# **Pandas**

In [2]:
import pandas as pd

In [8]:
#its in the form of series pattern to show output
a=[1,3,4,5,6]
s=pd.Series([a])
print(s.dtype)

object

In [10]:
#DataFrame:its give the op in structured or organized formate
a={"name":["abi","abinesh","kali"],
   "tamil":[95,90,70],
   "english":[92,80,45],
   "maths":[95,75,40]}
b=pd.DataFrame(a)
print(b)

      name  tamil  english  maths
0      abi     95       92     95
1  abinesh     90       80     75
2     kali     70       45     40

In [12]:
print(b["name"]) #b is converted dataframe formate
a["name"] #its gives a formate of original in list formation

0        abi
1    abinesh
2       kali
Name: name, dtype: object

['abi', 'abinesh', 'kali']

In [23]:
# LOCATE ROW
print(b.loc[0])    #its perform based on index of row in formate data set  series form
b.loc[[1]]        # its also same but its form of dataframe

name       abi
tamil       95
english     92
maths       95
Name: 0, dtype: object

      name  tamil  english  maths
1  abinesh     90       80     75

In [25]:
print(b.loc[[0,1]])

      name  tamil  english  maths
0      abi     95       92     95
1  abinesh     90       80     75

In [31]:
a={"name":["abi","abinesh","kali"],
   "tamil":[95,90,70],
   "english":[92,80,45],
   "maths":[95,75,40]}
b=pd.DataFrame(a,index=[1,2,3])
print(b)
b.loc[[1,2]]

      name  tamil  english  maths
1      abi     95       92     95
2  abinesh     90       80     75
3     kali     70       45     40

      name  tamil  english  maths
1      abi     95       92     95
2  abinesh     90       80     75

In [42]:
b.loc[[1,2]] #multiple rows

      name  tamil  english  maths
1      abi     95       92     95
2  abinesh     90       80     75

In [47]:
b.loc[[1,2]]      #its perform by rows
b.iloc[[1]]       #its perform by positon of index

      name  tamil  english  maths
2  abinesh     90       80     75

In [ ]:
#5 to 10
# stu1
#